attempt = 0
while True:
    a = int(input("Введіть ваш бал: "))
    if a>=0 and a<=100:
        print(f"Ваш бал = {a}")
        break
    elif a>100:
        print("Ви ввели занадто високий бал, такого не існує. введіть бал від 0 до 100")
    elif a<0:
        print("Ви ввели занадто низький бал, такого не існує. введіть бал від 0 до 100")
    attempt += 1
print("Кількість спроб: ", attempt)
#  я не знайшов таблиці зі шкалою яка має бути в сьомій практичній, але робиться це поза циклом через if/elif
